In [1]:
import pandas as pd

In [2]:
def print_(data):
    print(data, end='\n'+'*'*30+'\n')

In [3]:
#Creation
s = pd.Series([90,40,60,87])
s

0    90
1    40
2    60
3    87
dtype: int64

In [4]:
print(type(s))
print(s.dtype)
print(s.shape)
print(s.ndim)
print(s.size)

<class 'pandas.core.series.Series'>
int64
(4,)
1
4

In [5]:
s1 = pd.Series([4,2,7,8,9,3,5,7,6,8], name='data')
print_(s1[0])#acessing
print_(s1[:4])#slicing
s1[0] = 40
print_(s1)#modify
s1[12] = 50#insertion
print_(s1)

4
******************************
0    4
1    2
2    7
3    8
Name: data, dtype: int64
******************************
0    40
1     2
2     7
3     8
4     9
5     3
6     5
7     7
8     6
9     8
Name: data, dtype: int64
******************************
0     40
1      2
2      7
3      8
4      9
5      3
6      5
7      7
8      6
9      8
12    50
Name: data, dtype: int64
******************************

In [7]:
s3 = pd.Series({'a':45,'b':67,'c':50,'d':11})
s3

a    45
b    67
c    50
d    11
dtype: int64

In [9]:
df1 = pd.DataFrame([[3,4],[5,6],[7,8]])
df1

   0  1
0  3  4
1  5  6
2  7  8

In [10]:
s

0    90
1    40
2    60
3    87
dtype: int64

In [11]:
print(df1.shape)
print(df1.size)
print(df1.ndim)

(3, 2)
6
2

In [15]:
df3 = pd.DataFrame({
    'a':[34,15,21],
    'b':[45,'nice',78],
    'c':[67,0,45],
    'd':'wow'
})
df3

    a     b   c    d
0  34    45  67  wow
1  15  nice   0  wow
2  21    78  45  wow

In [17]:
#item accesing
print(df3['a'])
print(df3.loc[1])
print(df3.T)

0    34
1    15
2    21
Name: a, dtype: int64
a      15
b    nice
c       0
d     wow
Name: 1, dtype: object
     0     1    2
a   34    15   21
b   45  nice   78
c   67     0   45
d  wow   wow  wow

In [18]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      object
 2   c       3 non-null      int64
 3   d       3 non-null      object
dtypes: int64(2), object(2)
memory usage: 224.0+ bytes

In [19]:
df3.describe()

               a          c
count   3.000000   3.000000
mean   23.333333  37.333333
std     9.712535  34.151623
min    15.000000   0.000000
25%    18.000000  22.500000
50%    21.000000  45.000000
75%    27.500000  56.000000
max    34.000000  67.000000